aides/plantuml/admin_cas_utilisation.puml
@startuml
left to right direction
skinparam packageStyle rectangle
skinparam shadowing false
skinparam actorStyle awesome

actor Administrateur as Admin

rectangle "Application web de suivi hospitalier" {
  usecase "S'authentifier" as UC1
  usecase "Gérer les comptes\nde connexion" as UC2
  usecase "Gérer les profils" as UC3
  usecase "Gérer les utilisateurs" as UC4
  usecase "Gérer les patients" as UC5
  usecase "Gérer les dossiers\npatients" as UC6
  usecase "Gérer les greffes" as UC7
}

Admin -- UC1
Admin -- UC2
Admin -- UC3
Admin -- UC4
Admin -- UC5
Admin -- UC6
Admin -- UC7

@enduml
